In [4]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [21]:
names = ['Nourah', 'Sarah', 'Ahmed']
index = [1,2,3]
s = pd.Series(names, index=index)
s

1    Nourah
2     Sarah
3     Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [22]:
s.index = [11, 12, 13 ]
s

11    Nourah
12     Sarah
13     Ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [23]:
s[0:2]

11    Nourah
12     Sarah
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [24]:
#Add duplicate elements
s4 = pd.Series({14 : 'Ahmed'})
s = s.append(s4)
s

C:\Users\ragha\AppData\Local\Temp\ipykernel_7848\2115324193.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s = s.append(s4)

11    Nourah
12     Sarah
13     Ahmed
14     Ahmed
dtype: object

In [25]:
#remove the duplication
s.drop_duplicates()

11    Nourah
12     Sarah
13     Ahmed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [28]:
 students = {'Name': ['Kathey', 'Michael', 'William', 'Kathey', 'William', 'Kathey', 'Michael'],
        'ID': [111, 222, 333, 444, 555, 666, 777],
        
        
       }

x = pd.DataFrame(students, columns=['Name', 'ID',])
x

      Name   ID
0   Kathey  111
1  Michael  222
2  William  333
3   Kathey  444
4  William  555
5   Kathey  666
6  Michael  777

## Q6: Read educ_figdp_1_Data.csv file

In [27]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [29]:
#slicing does't inclued the end
edu[10:14]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s

In [30]:
# loc inclued the end
edu.loc[10:14]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e